#!/bin/sh

echo '
====================================================================================
S3のセットアップを初めています。
===================================================================================='
echo "S3 setup start!"
# https://qiita.com/Shoma0210/items/258e8422d5341160624b
aws s3 ls --endpoint-url=http://localhost:4566
if [ $? -ne 0 ]
then
echo -e "S3の接続に失敗しました。aws configureのlocalstackの設定を確認してください。https://qiita.com/Shoma0210/items/258e8422d5341160624b"
exit 1
fi

TEXT=''
for v in `cat ../.env.sample | grep -e '.*_bucket'`;
do
  var=`echo $v | sed -e 's/_/-/g' -e 's/=//g'`
  buckets=`aws s3 ls --endpoint-url=http://localhost:4566 | grep $var` && :
  if [ $? -ne 0 ] 
  then
    aws --endpoint-url=http://localhost:4566 s3 mb s3://$var
    echo -e "$varバケットが作成されました。"
  else
    echo -e "バケットは既に作成されています。"
  fi
  TEXT+="$v$var \n"
done

echo '
====================================================================================
バケットが作成されました。local環境のenvファイルに以下の環境変数を追加してください。
===================================================================================='
echo -e "$TEXT"


echo '
====================================================================================
S3のセットアップが完了しました。
===================================================================================='